    CREATE TABLE Artist (
        Artistname VARCHAR(100) PRIMARY KEY,
        member VARCHAR(45) NULL
        );

    CREATE TABLE Style(
        stylename VARCHAR(20)  PRIMARY KEY
        );
    
    CREATE TABLE Song(
        Songname VARCHAR(45) PRIMARY KEY,
        Lenght VARCHAR(45)  NULL,
        Lyrics VARCHAR(15000)  NULL,
        Album_Albumname VARCHAR(45) NOT NULL,
        Album_Artistname VARCHAR(45) NOT NULL,
        Album_Stylename VARCHAR(45) NOT NULL
        );

    CREATE TABLE Album(
        Albumname VARCHAR(45)  PRIMARY KEY,
        Year_of_release VARCHAR(45) NULL,
        Photoalbum VARCHAR(45) NULL,
        Artish_Artistname VARCHAR(45) NOT NULL,
        Style_Stylename VARCHAR(45) NOT NULL
        );

    INSERT INTO Artist (Artistname)
    VALUES ('Potato.'),
            ('Getsunova'),
            ('tattoo color');

    INSERT INTO Style (stylename)
    VALUES ('pop rock'),
            ('pop')
           ;
    
    INSERT INTO Song (Songname,Lenght,Lyrics,Album_Albumname,Album_Artistname,Album_Stylename)
    VALUES ('เธอยัง','00:04:51','ฉันยังเป็นคนที่รักเธอหมดใจ
    ฉันยังได้แต่คิดถึงเธอเรื่อยไป
    ฉันยังดูรูปถ่ายที่เราชิดใกล้อยู่ทุกวัน
    ฉันยังรอคอยให้เธอนั้นกลับมา
    ฉันยังกาปฏิทินทุกคืนวัน
    เพราะคำเดียว ระยะทาง
    ที่มาขวางกั้นเราไว้
    ได้แต่คิดแล้วก็สงสัย
    อยู่ตรงนั้นเธอเป็นอย่างไรก็ไม่รู้
    ฝากเพลงนี้ให้ไปถามเธอดู
    อยากจะรู้ในความเป็นไป
    เธอยังคิดถึงฉันทุกนาทีรึเปล่า
    เธอยังจำเรื่องเราในวันวานได้หรือไม่
    เธอยังมีใจให้ฉันคนเดียว ยังรอฉันแค่คนเดียว
    เธอยังคงเป็นเหมือนเดิมอยู่ใช่ไหม
    ช่วยบอกให้รู้ที
    ฉันกลัวใครทำให้เธอนั้นเปลี่ยนไป
    ฉันกลัวสิ่งที่ไม่แน่นอนมากมาย
    ฉันกลัวคำว่าเสียใจ เธอรอฉันได้ใช่ไหม
    ได้แต่คิดแล้วก็สงสัย
    อยู่ตรงนั้นเธอเป็นอย่างไรก็ไม่รู้
    ฝากเพลงนี้ให้ไปถามเธอดู
    อยากจะรู้ในความเป็นไป
    เธอยังคิดถึงฉันทุกนาทีรึเปล่า
    เธอยังจำเรื่องเราในวันวานได้หรือไม่
    เธอยังมีใจให้ฉันคนเดียว ยังรอฉันแค่คนเดียว…!','Human','Potato','pop rock');
    
        ('ทิ้งไว้กลางทาง','00:04:53','มันดีแค่ไหนกัน
    ที่เราได้ร่วมทาง
    จนถึงวันนี้ก็เนิ่นนาน
    มันเป็นเพราะฉันเอง
    ยังดีไม่มากพอ
    ทำที่เธอขอไม่ได้เลย
    เมื่อเธอจะไปก็เข้าใจ
    เมื่อเธอเจอใครดีกว่ามากมาย
    คงไม่ต้องรอ
    ทำถูกแล้ว
    ที่เธอเลือกเขา
    และทิ้งฉันไว้ตรงกลางทาง
    เมื่อตัวเธอ
    พบคนที่ดี
    ที่เธอวาดไว้ในหัวใจ
    ปล่อยมือฉัน
    ถูกแล้ว
    ให้ใจของฉันปวดร้าวแค่ไหน
    ยอมฝืนใจให้เธอ
    เดินจากฉันไป
    เมื่อรู้ว่าเธอ
    มีคนที่พาไปถึงปลายทาง
    ความจริงที่ฉันกลัว
    กลัวการไม่มีเธอ
    กลัวถึงวันนี้มาเนิ่นนาน
    เพียงคำว่ารักเธอ
    มันคงไม่เพียงพอ
    ให้รั้งเธอไว้ไม่ได้เลย
    เมื่อเธอจะไปก็เข้าใจ
    เมื่อเธอเจอใครดีกว่ามากมาย
    คงไม่ต้องรอ โฮ้
    ทำถูกแล้ว
    ที่เธอเลือกเขา
    และทิ้งฉันไว้ตรงกลางทาง
    เมื่อตัวเธอ
    พบคนที่ดี
    ที่เธอวาดไว้ในหัวใจ
    ปล่อยมือฉันถูกแล้ว…','ชุดที่ 7','Potato','pop rock'),

        ('Getsunova','00:04:26','พยายามจะทำวิธีต่างๆ ให้เธอนั้นรักฉัน
    พยายามทุกวัน มอบให้ทุกอย่างที่เธอต้องการ
    เหมือนเดินบนสะพานที่มีปลายทางคือใจของเธอ
    ยังคงคิดและหวังจะนำเอารักแท้นี้ไปให้
    แต่ทำไม เดินมาเนิ่นนานไม่ถึงซักที
    แต่ทำไม มองดูเส้นทางเหมือนยาวออกไป
    อยากรู้ว่าฉันต้องทำตัวอย่างไร
    อีกไกลแค่ไหน จนกว่าฉันจะใกล้ บอกที
    อีกไกลแค่ไหนจนกว่าเธอจะรักฉัน เสียที
    มีทางใดที่อาจทำให้เธอสนใจ ได้โปรด
    บอกกับฉันให้รู้ที ว่าสุดท้ายแล้วฉันยังมีความหมาย
    ยังไม่คิดยอมแพ้ ฉันเพียงแต่อ้อนล้าก็เท่านั้น
    ภายในใจยังคงรักเธอเหมือนเดิม ไม่เคยเปลี่ยน
    คงจะดีไม่น้อย ถ้าเธอบอกให้ฉันได้รับรู้
    ความในใจของเธอ เหตุผลต่างต่างที่ยังซ่อนไว้
    ว่าทำไมเดินมาเนิ่นนานไม่ถึงซักที
    แต่ทำไม มองดูเส้นทางเหมือนยาวออกไป
    อยากรู้ว่าฉันต้องทำตัวอย่างไร
    อีกไกลแค่ไหน จนกว่าฉันจะใกล้ บอกที
    อีกไกลแค่ไหนจนกว่าเธอจะรักฉัน เสียที…','the first album','Getsunova','pop rock'),

        ('ฟ้า','ฺ00:04:38','ในตอนที่ฉันเตะประตู ทุกๆคนต่างมองมาที่ฉัน
    คิดอยู่ ว่าต้องทนไหว
    จะทุกข์จะทนเท่าไร
    ความรักจะพาหัวใจไป
    คิดเอง ว่าต้องทนไหว
    แต่ยิ่งทุกข์ยิ่งทนเท่าไร
    ความรักที่มียิ่งหายไป
    * จะโทษดิน จะโทษน้ำ
    จะโทษเดือนและดาว
    กับเรื่องราว ที่ปวดร้าว
    ที่เธอมาทำแล้วหนีไป
    ฟ้า ถ้าไม่ส่งมา ให้เธอมีใจ
    บอกกันสักคำเป็นไร
    ว่าเหตุใดต้องมาทำร้ายกัน
    จากนี้ เรื่องราวที่มี
    ก็ให้ลืมมันไป
    อย่าจำว่าเคยเป็นใคร
    ว่ามีใครที่เคยทำร้าย
    คนอย่างฉัน
    ทุกวัน จวบจนวันนี้
    ชีวิตที่เราต้องมี
    จากนี้ต้องทำตัวเช่นไร
    น้ำตา ที่ยังรินไหล
    จากความรักที่มีทั้งใจ
    สุดท้ายเขานั้นหายไป
    ฟ้า ถ้าไม่ส่งมา ให้เธอมีใจ
    บอกกันสักคำเป็นไร
    ว่าเหตุใดต้องมาทำร้ายกัน
    จากนี้ เรื่องราวที่มี
    ก็ให้ลืมมันไป
    อย่าจำว่าเคยเป็นใคร…','Hong ser','tattoo color','pop'),

        ('เผลอไป','00:03:47','ดึกแล้วเราก็ยังไม่กลับ นอนเราก็นอนไม่หลับ
    เกือบจะเวลาเช้า ในคืนที่เหน็บหนาว
    คุยกันถึงเรื่องเก่าๆ วันที่เราไม่เหลือใคร
    เย็นมือคล้ายๆ มันสั่น มองเธอแล้วใจยังหวั่น
    กอดสักทีได้ไหม แต่ก็ข่มใจไว้
    ความจริงฉันคงไม่กล้า ปล่อยให้มันผ่านพ้นไป
    และช่วงเวลา ไม่รู้อะไร
    ที่มากดดันให้ฉันได้เฉลยในใจ ไม่กล้าจะเอ่ย
    ให้ฉันได้พูดไปอย่างนั้น
    ว่าฉันนั้นรักเธอ ก็ปากมันเผลอไป
    ในเวลาที่สองเราอ่อนไหว ได้ตัดสินใจพูดคำว่ารัก
    และฉันไม่รู้ตัว ได้แต่ยอมรับมัน
    เก็บคำบางคำซ่อนไว้ว่าใจฉันนั้นรักเธอ ฉันเผลอออกไป
    ต่อให้มองเธอเท่าไรไม่เบื่อ คุยกันเหมือนเราเป็นเพื่อน
    กอดสักทีได้ไหม แต่ต้องข่มใจไว้
    เอาจริงๆ ฉันคงไม่กล้า ปล่อยให้มันผ่านพ้นไป
    และช่วงเวลา ไม่รู้อะไร
    ที่มากดดันให้ฉันได้เฉลยในใจ ไม่กล้าจะเอ่ย
    ให้ฉันได้พูดไปอย่างนั้น
    ว่าฉันนั้นรักเธอ ก็ปากมันเผลอไป…
    ','pop dad','tattoo color','pop');
        



    INSERT INTO Album (Albumname,Year_of_release,Photoalbum,Artish_Artistname,Style_Stylename)
    VALUES ('Human','2554','https://image.dek-d.com/24/2672008/107957207','Potato','pop rock'),
           ('ชุดที่ 7','2562','https://www.fungjaizine.com/wp-content/uploads/2019/05/potato.jpg','potato','pop rock'),
           ('the first album','2559','https://cf.shopee.co.th/file/5e93c75897244b4935622e59ea6eadde','Getsunova','pop rock'),
           ('Hong ser','2556','https://4.bp.blogspot.com/-1HHOyI6ARTs/VHnIOScE9-I/AAAAAAAAAZo/cvfRt94OPnw/s1600/Hong%2BSer.jpg','tattoo color','pop'),
           ('pop dad','2560','https://angartwork.akamaized.net/webp/?id=2804335&size=296','tattoo color','pop');


